{
  "title": "Terms and Conditions",
  "lastUpdated": "January 2025",
  "sections": [
    {
      "heading": "1. Agreement to Terms",
      "content": "By accessing or using the Mashariq Al-Arkan website and services, you agree to be bound by these Terms and Conditions. If you disagree with any part of these terms, then you may not access the service. These Terms apply to all visitors, users, and others who access or use the service."
    },
    {
      "heading": "2. Use License",
      "content": "Permission is granted to temporarily download one copy of the materials on Mashariq Al-Arkan's website for personal, non-commercial transitory viewing only. This is the grant of a license, not a transfer of title, and under this license you may not:",
      "list": [
        "Modify or copy the materials",
        "Use the materials for any commercial purpose or for any public display (commercial or non-commercial)",
        "Attempt to decompile or reverse engineer any software contained on the website",
        "Remove any copyright or other proprietary notations from the materials",
        "Transfer the materials to another person or 'mirror' the materials on any other server"
      ],
      "contentAfter": "This license shall automatically terminate if you violate any of these restrictions and may be terminated by Mashariq Al-Arkan at any time. Upon terminating your viewing of these materials or upon the termination of this license, you must destroy any downloaded materials in your possession whether in electronic or printed format."
    },
    {
      "heading": "3. Services Description",
      "content": "Mashariq Al-Arkan provides end-to-end entrance systems and security solutions including design, supply, installation, and lifecycle maintenance services. We reserve the right to modify, suspend, or discontinue any part of our services at any time, with or without notice. We shall not be liable to you or any third party for any modification, suspension, or discontinuance of the services."
    },
    {
      "heading": "4. User Accounts",
      "content": "When you create an account with us, you must provide information that is accurate, complete, and current at all times. You are responsible for safeguarding the password and for all activities that occur under your account. You agree not to disclose your password to any third party and to take sole responsibility for any activities or actions under your account, whether or not you have authorized such activities or actions."
    },
    {
      "heading": "5. Prohibited Uses",
      "content": "You may use our service only for lawful purposes and in accordance with these Terms. You agree not to use the service:",
      "list": [
        "In any way that violates any applicable national or international law or regulation",
        "To transmit, or procure the sending of, any advertising or promotional material without our prior written consent",
        "To impersonate or attempt to impersonate the company, a company employee, another user, or any other person or entity",
        "In any way that infringes upon the rights of others, or in any way is illegal, threatening, fraudulent, or harmful",
        "To engage in any other conduct that restricts or inhibits anyone's use or enjoyment of the website, or which may harm the company or users of the website"
      ]
    },
    {
      "heading": "6. Intellectual Property Rights",
      "content": "The service and its original content, features, and functionality are and will remain the exclusive property of Mashariq Al-Arkan and its licensors. The service is protected by copyright, trademark, and other laws. Our trademarks and trade dress may not be used in connection with any product or service without our prior written consent."
    },
    {
      "heading": "7. Disclaimer",
      "content": "The materials on Mashariq Al-Arkan's website are provided on an 'as is' basis. Mashariq Al-Arkan makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties including, without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights.",
      "contentAfter": "Further, Mashariq Al-Arkan does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials on its website or otherwise relating to such materials or on any sites linked to this site."
    },
    {
      "heading": "8. Limitations",
      "content": "In no event shall Mashariq Al-Arkan or its suppliers be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption) arising out of the use or inability to use the materials on Mashariq Al-Arkan's website, even if Mashariq Al-Arkan or a Mashariq Al-Arkan authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you."
    },
    {
      "heading": "9. Accuracy of Materials",
      "content": "The materials appearing on Mashariq Al-Arkan's website could include technical, typographical, or photographic errors. Mashariq Al-Arkan does not warrant that any of the materials on its website are accurate, complete, or current. Mashariq Al-Arkan may make changes to the materials contained on its website at any time without notice. However, Mashariq Al-Arkan does not make any commitment to update the materials."
    },
    {
      "heading": "10. Links to Other Websites",
      "content": "Our service may contain links to third-party websites or services that are not owned or controlled by Mashariq Al-Arkan. Mashariq Al-Arkan has no control over, and assumes no responsibility for, the content, privacy policies, or practices of any third-party websites or services. You further acknowledge and agree that Mashariq Al-Arkan shall not be responsible or liable, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with the use of or reliance on any such content, goods, or services available on or through any such websites or services."
    },
    {
      "heading": "11. Termination",
      "content": "We may terminate or suspend your account and bar access to the service immediately, without prior notice or liability, under our sole discretion, for any reason whatsoever and without limitation, including but not limited to a breach of the Terms. If you wish to terminate your account, you may simply discontinue using the service."
    },
    {
      "heading": "12. Governing Law",
      "content": "These terms and conditions are governed by and construed in accordance with the laws of the Kingdom of Saudi Arabia and you irrevocably submit to the exclusive jurisdiction of the courts in that location."
    },
    {
      "heading": "13. Changes to Terms",
      "content": "We reserve the right, at our sole discretion, to modify or replace these Terms at any time. If a revision is material, we will provide at least 30 days notice prior to any new terms taking effect. What constitutes a material change will be determined at our sole discretion. By continuing to access or use our service after any revisions become effective, you agree to be bound by the revised terms."
    },
    {
      "heading": "14. Contact Information",
      "content": "If you have any questions about these Terms and Conditions, please contact us at:",
      "contact": {
        "email": "legal@mashariq-alarkan.com",
        "phone": "+966 12 345 6789",
        "address": "King Fahd Road, Riyadh, Kingdom of Saudi Arabia"
      }
    }
  ]
}

